# CwpLevelOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpLevelOffset Property
ParameterTypeId Class See Also
---
"Offset Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpLevelOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpLevelOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpLevelOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace